# frozen_string_literal: true
titles = [
'第28回　廣田鑑賞会能',
'京都観世会5月例会',
'金剛定期能',
'市民狂言会',
'独立25周年記念 第16回 吉浪壽晃 能の会',
'県民のための能を知る会',
'金春会定期能',
'演能の会　高崎公演　レクチャー',
'志の輔らくご at NOH THEATER',
'シア能楽公演 金剛流による能「羽衣」を上演「樂―茶碗の中の宇宙展」開催記念',
'お豆腐の和らい「都の賑わい」京都公演',
'水無月狂言の集い',
'伝統芸能　狂言を楽しむ会',
'第2回加西能',
'井上同門定期能楽会',
'大槻能楽堂自主公演能　能の魅力を探るシリーズ－能と和歌－',
'第二回 風の能',
'おうみ狂言図鑑 2017',
'財団設立20周年記念　第209回公演　いばらき能「安達原」',
'河村定期研能会',
'能楽アフタヌーンティー「俊寛」',
'能の音楽～お囃子の魅力　～能管と三種の打楽器そして掛け声が織りなす、ザ・ニッポン・サウンド～',
'祇園祭狂言奉納',
'有馬能楽堂　能公演',
'高槻現代劇場 こども広場 第2回　ごにんばやしになってみよう！',
'初心者のための能楽体験講座 ',
'素謡会',
'横浜アート de 街コン',
'世阿弥供養祭',
'遊行寺薪能',
'国立能楽堂公開講座',
'能楽チャリティ公演～被災地復興、京都からの祈り～',
'日中韓芸術祭２０１７　－おどる、つなぐ、こえる－',
'第13回　演能の会　東京公演',
'名古屋能楽堂　バックステージツアー',
'『新・舞サロン』～能楽師から学ぶ所作・教養～',
'触れてみよう！能の世界',
'第18回しぶかわ能鑑賞会',
'野村万作・萬斎　狂言の世界２０１７',
'美しき能の世界',
'銕仙会 定期公演',
'映画と能',
'第七回　一之輔落語　竹灯籠能',
'宝生会 月並能',
'梅若会特別公演',
'大倉祖先祭',
'国立能楽堂定例公演',
'朋之会別会　武田太加志三十三回忌追善能',
'グランシップ静岡能　能楽入門公演',
'第12回　奥川恒治の会'
]

informations = [
"主役を勤める五流派（観世・宝生・金春・喜多・金剛）をシテ方といいます。そのシテの相手役を務めるワキ方と、笛・小鼓・大鼓・太鼓を演奏する囃子方、そして狂言方があります。シテとワキに連れられて出てくる役をツレ・ワキツレと呼びます。",
'',
"平成29年度の金剛定期能は年10回公演となります。毎月、宗家以下総出演で佳曲を揃えました。 また上演前に演目の解説も行います。29年度も多くの皆様にご鑑賞願いたく、絶大のご後援を賜ります様宜しくお願い申し上げます。皆様のご入会を心よりお待ち申し上げております。なお4月は特別公演として東本願寺能舞台にて開催いたします。",
"KAC　Performing　Arts　Program　/　Contemporary　Danceでは、京都芸術センターの創作環境を活かし、コンテンポラリーダンス表現の最前線で活躍する振付家・ダンサーを迎えて新作の創作・上演および旧作の再創作を行う。",
'',
'',
'',
"当社（難波八阪神社）の創建年月日など詳しい資料は残っていませんが、社伝によれば古来「難波下の宮」と称し難波一帯の産土神でした。後三条天皇の延久（1069年から1073年）の頃から祇園牛頭天王（ごずてんのう）をお祀りする古社として世間に知られていました。もとは神仏混淆でしたが、維新後、神仏分離により寺は廃絶し、明治5年(1872年)に郷社となりました。現在のご本殿は、昭和49年（1974年）5月に完成。毎年１月の第３日曜日に行われている綱引神事は当社の御祭神、素盞嗚尊（すさのをのみこと）が八岐大蛇（やまたのおろち）を退治し、民衆の困苦を除かれた故事に基づき始めれたと言われています。「摂津名所図絵」や「摂津名所図会大成」にも紹介されています。また、平成13年(2001年)には、大阪市で初めての無形民俗文化財に指定されました。",
"銀座六丁目に居を移し、新たな歴史を刻み始めた観世能楽堂で初の落語会を銀座花鏡開幕記念公演としてお届けします。日本の伝統文化の真髄を伝える劇場で、立川志の輔による新たな幕が開きます。志の輔らくごで、こころ揺さぶられるひとときをお楽しみください。",
"650 年の歴史を持つ能楽界において五流のうち四流の宗家が東京を本拠地とする中で、京都に宗家が存在する唯一の流儀である金剛流。サンクトペテルブルクの公演では 、二十六世宗家・金剛永謹師の監修・出演による 「羽衣」をはじめ、重厚かつ華やかな舞台を披露し 、日本が誇る伝統芸能の魅力をお届けします。",
"毎年恒例の、茂山千五郎家・クラブSOJA企画のお楽しみ狂言会「お豆腐の和らい（わらい）」今年は「都の賑わい」と題しまして、茂山千五郎家が本家を構える京都にまつわる三演目を上演致します。色鮮やかな変化に富んだ都の面白さ、可笑しさをどうぞお楽しみくださいませ。",
'',
'',
"新作能『針間」は哲学者梅原猛さんの書き下ろしによるもので、2人の皇子（意奚と袁奚）が皇位継承争いの続く都から志染の里（現三木市）に逃れて、それぞれ牛飼いと馬飼いになり、後に都で仁賢天皇と顕宗天皇になった話を描いています。『高砂』には観世銕之丞さんら、『針間』には人間国宝の大槻文蔵さんら能楽師の一線級がそろい、観客らは美しい舞に酔いしれ、延べ約1時間半の上演が終わると、会場は大きな拍手に包まれた。大槻さんは「（2年前と比べて）今回はホールだったので凝縮した感じで一体感があった。また機会があれば演じたい」と話されました。",
"当初、「薪御能」は、舞台が野外の芝生であったため、紙を敷き踏んで芝の状態を見たとされています。現在は、敷き舞台の上で行う為、その必要はありませんが、芝の湿り具合いで能のあるなしを決めていたことを今に伝えるため、演能の前に興福寺衆徒（僧兵）により「舞台あらため」が行われます。また、その結果を人々に伝えるために「外僉義（げのせんぎ）」文が読み上げられます。外僉義文は、寺の外部の人達に向けて僉義を発表するものです。これらの儀式は他では見ることのできない「薪御能」だけの特色です。",
'',
'',
'ニンジャカジャと大名、そしてちょっとタロウカジャ',
"解説つきで能の全曲をお楽しみいただける「いばらき能」。昨年度の「葵上」に続き、鬼女をテーマとした能「安達原」をお送りします。",
'※ゆかた（その他和装）でお越しの方を対象に7月25日「天神祭能船」の乗船券など豪華景品が当たる抽選会をご用意しています！ ',
'能「俊寛」は平家物語を題材に、謀反を企てた一味の鬼界ヶ島へ流罪となった、３人の物語です。中でも俊寛だけは赦免されず、一人鬼界ヶ島に取り残されます。俊寛の怒り、孤独、未練を全６回でじっくりと紐解いてまいります。能楽アフタヌーンティーではスペシャルなテーマでお話するパートと、謡本をじっくり読み進めていくパートの２部構成です。その合間に素敵なデザートをお楽しみいただきます。',
'年末年始(大晦日夜から元旦)にかけての無病息災・厄除けのお参りです。年末新しくきりだしたをけら火を、火縄にうつして持ち帰り、火伏せの御守として台所にお祀り下さい。',
'世界初、能舞台のあるステーキレストラン「三田屋本店－やすらぎの郷－」は、こだわりのハムと自慢のステーキをメインに、五感でお楽しみいただける食空間をご提供いたします。また、お中元やお歳暮など大切な人へのギフトにもオススメいたします。',
'',
'能公演の他にもワークショップ、レクチャーと実演や展示解説などさまざまな形式で能楽の普及に努めています。',
'一期一会の舞台に幼いうちから立つことは、他とは違った意識を育てます。夙川の風景の豊かさの中、舞と謡を通じて、お子様に美しい日本語、美しい立ち姿を体験していただきたく思います。）曜日、時間等、ご相談に応じます。気軽にご連絡下さい。',
'狂言を皆で鑑賞した後に、ドリンク、お食事付きの交流会を実施バックステージに入れる「舞台裏見学ツアー」あり能楽堂スタッフによる解説付き',
'太鼓芸能集団「鼓童」が1988年より開催している夏のフェスティバル。国内外から音楽ファンが訪れ賑わいます。ワークショップ、プロ・アマ問わずパフォーマンスを披露できるフリンジ、プレ公演「薪能」など多彩なプログラムを展開。期間中、小木みなと公園ではフリーマーケットが開催されます。',
'初秋の風物詩となっている「遊行寺薪能」です。一遍上人が祖父の供養のために始めたとされる「すすき念仏」からはじまり、能や狂言をお楽しみいただけます。',
'',
'京都観世会館・金剛能楽堂でも取り扱いあり',
'（各国を代表するダンサー等による現代舞踊公演）中村恩恵（振付家・舞踊家），宝満直也・中島瑞生・渡邊拓朗（新国立劇場バレエ団）ほか詳しいことはわかりませんが、、能のお囃子の方がご出演だそうです。',
'',
'観能の夕べをより楽しむために開演前（特別公演を除く）に演目に関する体験を実施します。（当日の鑑賞者に限ります）申込み：石川県立能楽堂（076-264-2598）ぜひ能楽堂へお越しください',
'',
'長崎市立図書館併設 新興善メモリアルホール＊白足袋を持参くださいませ。講座後に図書館内カフェにて茶話会があります。',
'詩的で美しい能です。古来、熊野、松風は米の飯（毎日食べても飽きずに美味しい。毎日観ても飽きないほどの作品）といわれてきた名曲。優美でゆったりとした風情。そして、徐々に湧き上がって行く女の情愛。謡曲随一の謡いの美しさ。名曲ゆえに上演難度の高い作品です。前回の「砧」公演でも共演した佐久間二郎君を妹・村雨役にして今回も頑張ってみたいと思います。',
'しぶかわ能は、日本の伝統芸能の鑑賞機会を中学生や市民に提供し、本物の醍醐味を体感してもらおうと平成12年度から開催しています。市内9校の中学3年生を招待するとともに、一般席のチケットを販売しています。能は、ユネスコの無形文化遺産に日本で最初に採択された、日本が世界に誇る伝統芸能です。文学、演劇、美術、音楽などの要素をもつ総合芸術ですので、見方によって様々な感動を味わうことができます。今年は宝生流能楽師による能「殺生石」をメーンに、仕舞、狂言を上演します。この機会にどうぞご鑑賞ください。なお、中学生を主な対象とした事業のため、一般席は後列となりますのでご承知おきください。',
'',
'',
'「伝統芸能を身近に感じること」「ワークショップを通じて人と人がつながること」「伝統芸能が地域に根づくこと」を目的として、伝統芸能のプロフェッショナルを講師に迎えて３つの講座を実施します。また2018年2月25日（日）には、本格的な舞台で発表会をおこないます。',
'',
'',
'このたびは、宝生会の公演チケット予約をご利用いただきありがとうございます。',
'メールでのお申込みの場合、ご住所、連絡先などご明記頂きお申し込み下さい。（特別公演等、一部チケットの販売方法が通常と異なる場合がございますので、ご注意下さい。）チケットと請求書を送付致しますので、請求書に記載されております銀行口座にチケット代金と送料を後日お振込み下さい。',
'',
'有斐斎弘道館（ゆうひさい こうどうかん）は、江戸中期の京都を代表する儒者・皆川淇園（みながわきえん／1734-1807）が創立した学問所です。淇園は開物学という独自で難解な学問を創始する一方、詩文や書画にも優れた風流人で、門弟３千人と言われました。2009年にマンションになりかけたことから有志により保存の声があがり、2013年に公益財団法人となりました。建造物ならびに庭園を保存するとともに、現代における学問所の再興をめざして、活動を続けています。',
'弊財団は、多くの方々から親身なご協力をいただき、昨秋に発足してから、4か月が経過しました。祖父や父、先人から受け継いだ大きな財産を大切に守りながら、たくさんの方々へ日本文化の心をお伝えしていきたいと思います。',
'8月定例会は第1土曜日になります。小野小町と深草少将の百夜通いを描く『通小町』を当主・観世喜之で。奥州安達原の鬼女伝説から『安達原』。伯父と思ったら詐欺師！？狂言『咲嘩』。見どころ満載の8月公演です。',
'ユネスコ無形文化遺産で日本が世界に誇る「人形浄瑠璃　文楽」を県内で鑑賞できる貴重な機会。お半・長右兵衛の「桂川連理柵」、お初・徳兵衛の「曽根崎心中」、世話物の名作を上演。字幕表記や出演者によるあらすじ解説もあるので、初めての方でもお気軽に。'
]

official_urls = [
'http://www.example.com/index.html',
'http://www.kanzei.com/5th-kai.html',
'http://www.example.com/regular.html',
'http://www.kac.or.jp/program/9443/',
'http://www.ecample.com/noh-no-kai.html',
'http://www.nohbutai.com/',
'',
'http://www.takasaki-foundation.or.jp/gallery/moyoosi.html',
'',
'',
'http://kyotokyogen.com/schedule/20170505waraikyoto/',
'http://kyotokyogen.com/schedule/20170624minazuki/',
'http://kyotokyogen.com/schedule/20170709kagoshima/',
'http://www.fudoki1300.city.kasai.hyogo.jp/nou/kasainou2/',
'https://narashikanko.or.jp/event/takigiono/',
'http://www.noh-kyogen.com/schedule/2017/05.html',
'http://www.susumushingu.com/news.shtml',
'',
'http://www.ibabun.jp/eventLeaf.php?eid=00267',
'',
'http://nohnohana.com/afternoon2017/shunkan/',
'http://www.gekito.jp/',
'http://www.yasaka-jinja.or.jp/',
'',
'',
'http://katoshingo.com/kouza.html',
'http://www.kanshou.com/kouen_2.htm ',
'https://machicon.jp/events/MPtKIx',
'http://www.visitsado.com',
'http://www.kanagawa-kankou.or.jp/event/ev_detail.php?eid=ek13754',
'http://www.ntj.jac.go.jp/nou/course.html ',
'http://rohmtheatrekyoto.jp/tickets/guide/',
'http://www.taf2017.jp/#cast',
'http://www.kanazawanohgakukai.jp/',
'http://www.bunka758.or.jp/scd24_top.html',
'',
'http://www.ne.jp/asahi/endows/page/index.html',
'http://www.city.shibukawa.lg.jp/kosodate/shougaigakushuu/syakaikyouiku/p000112.html',
'http://www.tajimi-bunka.or.jp/bunka/',
'https://www.instagram.com/p/BVBC3FSjSJg/?taken-by=ashiyanohbutai ',
'',
'http://www.tessen.org/ ',
'http://mitsukoshi.mistore.jp/bunka/product/7050900000000000000000557016.html?rid=17f1265ed4f441ae986c13c04c73041b',
'http://www.yoyoginoubutai.com/',
'http://www.hosho.or.jp/ticket/',
'http://kanze.net/publics/index/314/',
'http://www.ntj.jac.go.jp/nou.html ',
'http://ttmnf.or.jp/ ',
'http://www.granship.or.jp/',
'http://yarai-nohgakudo.com/'
]
new_date = Time.now

titles.count.times do |i|
   id = i + 1
   place_id = rand(387..434)
   user_id = rand(1..10)
   title = titles[i]


   if i % 5 == 0
      new_date += 3.days
   else
      new_date += 1.day
   end
   start_date = new_date

   information = informations[i]
   official_url = official_urls[i]
   published = true

   Event.seed do |s|
      s.id           = id
      s.place_id     = place_id
      s.user_id      = user_id
      s.title        = title
      s.start_date   = start_date
      s.information  = information
      s.official_url = official_url
      s.published    = published
   end
end
